const fs = require("fs");

const AdministrativeList = JSON.parse(
  fs.readFileSync("config/administrative-list.json", "utf8")
);

const map = {};

for (let index = 0; index < AdministrativeList.length; index++) {
  const { name, adcode } = AdministrativeList[index];

  if (map[name]) {
    console.log(name, map[name]);
    console.log(name, adcode);
  }
  map[name] = adcode;
}

// 桥西区 130104
// 桥西区 130703
// 新华区 130105
// 新华区 130902
// 城区 140302
// 城区 140502
// 和平区 120101
// 和平区 210102
// 铁西区 210106
// 铁西区 210303
// 朝阳区 110105
// 朝阳区 220104
// 铁西区 210303
// 铁西区 220302
// 铁东区 210302
// 铁东区 220303
// 向阳区 230402
// 向阳区 230803
// 郊区 140311
// 郊区 230811
// 西安区 220403
// 西安区 231005
// 宝山区 230506
// 宝山区 310113
// 鼓楼区 320106
// 鼓楼区 320302
// 通州区 110112
// 通州区 320612
// 海州区 210902
// 海州区 320706
// 普陀区 310107
// 普陀区 330903
// 郊区 230811
// 郊区 340711
// 鼓楼区 320302
// 鼓楼区 350102
// 西湖区 330106
// 西湖区 360103
// 市中区 370103
// 市中区 370402
// 河东区 120102
// 河东区 371312
// 鼓楼区 350102
// 鼓楼区 410204
// 新华区 130902
// 新华区 410402
// 青山区 150204
// 青山区 420107
// 永定区 350803
// 永定区 430802
// 南山区 230404
// 南山区 440305
// 城区 140502
// 城区 441502
// 龙华区 440309
// 龙华区 460106
// 南沙区 440115
// 南沙区 460302
// 江北区 330205
// 江北区 500105
// 市中区 370402
// 市中区 511002
// 市中区 511002
// 市中区 511102
// 白云区 440111
// 白云区 520113
// 新城区 150102
// 新城区 610102
// 长安区 130102
// 长安区 610116
// 城关区 540102
// 城关区 620102
// 城中区 450202
// 城中区 630103
// 东区 510402
// 东区 810003
